In [1]:
import pandas as pd
import constants

In [2]:
df_features = pd.read_csv(constants.FEATURES_PATH)

In [3]:
df_features.shape

(5000000, 9)

In [4]:
df_features.head()

,id,age,education,occupation,state,marital_status,home_owner,pet_owner,travel_frequency
0,1,69,High School,Teacher,OK,Married,True,False,Rarely
1,2,32,Bachelors,Engineer,VA,Single,False,False,Often
2,3,89,Masters,Artist,MI,Married,True,False,Often
3,4,78,Bachelors,Musician,IA,Married,True,False,Never
4,5,38,Bachelors,Engineer,NY,Divorced,False,False,Often

In [5]:
df_known_target = pd.read_csv(constants.TARGET_KNOWN_PATH)

In [6]:
df_known_target.shape

(4500000, 2)

In [7]:
df_known_target.head()

   id  income
0   1   31683
1   2   75308
2   3   62238
3   4   33615
4   5   98829